spec/fixtures/files/chargebee/subscription_created_with_coupon.json

{
  "id": "ev_BTUFGHJxDD46eeH",
  "occurred_at": 1729200081,
  "source": "hosted_page",
  "object": "event",
  "api_version": "v2",
  "content": {
    "subscription": {
      "id": "199PaHURUwwBN6cV0",
      "billing_period": 1,
      "billing_period_unit": "month",
      "customer_id": "BTUUpAURUxIut6edX",
      "status": "active",
      "coupons": [
        {
          "coupon_id": "DISCOUNT10",
          "applied_count": 1,
          "discount_amount": 1000,
          "duration_type": "forever",
          "metadata": {
            "tree_credits": 3,
            "tree_type": "yemani"
          }
        }
      ],
      "metadata": {
        "trees_per_year": 30,
        "tree_type": "yemani",
        "subscription_type": "family"
      },
      "current_term_start": 1729200078,
      "current_term_end": 1731882078,
      "next_billing_at": 1731882078,
      "created_at": 1729200078,
      "started_at": 1729200078,
      "activated_at": 1729200078,
      "created_from_ip": "95.98.121.227",
      "updated_at": 1729200081,
      "has_scheduled_changes": false,
      "channel": "web",
      "resource_version": 1729200081263,
      "deleted": false,
      "object": "subscription",
      "currency_code": "EUR",
      "subscription_items": [{
        "item_price_id": "1-boom-per-maand-EUR-Monthly",
        "item_type": "plan",
        "quantity": 1,
        "unit_price": 1000,
        "amount": 1000,
        "current_term_start": 1729200078,
        "current_term_end": 1731882078,
        "next_billing_at": 1731882078,
        "free_quantity": 0,
        "object": "subscription_item"
      }],
      "shipping_address": {
        "first_name": "Manes",
        "last_name": "Norws",
        "line1": "Astraat 4",
        "city": "Kborg",
        "state": "Grnd",
        "country": "NL",
        "zip": "1234 GG",
        "validation_status": "not_validated",
        "object": "shipping_address"
      },
      "due_invoices_count": 0,
      "mrr": 0,
      "has_scheduled_advance_invoices": false
    },
    "customer": {
      "id": "BTUUpAURUxIut6edX",
      "email": "test@example.com",
      "auto_collection": "on",
      "net_term_days": 0,
      "allow_direct_debit": true,
      "created_at": 1729200078,
      "created_from_ip": "95.98.121.227",
      "taxability": "taxable",
      "updated_at": 1729200081,
      "locale": "nl-NL",
      "pii_cleared": "active",
      "channel": "web",
      "resource_version": 1729200081555,
      "deleted": false,
      "object": "customer",
      "billing_address": {
        "first_name": "Manes",
        "last_name": "Norws",
        "line1": "Aalbersestraat 4",
        "city": "Astraat 4",
        "state": "Grnd",
        "country": "NL",
        "zip": "1234 GG",
        "validation_status": "not_validated",
        "object": "billing_address"
      },
      "promotional_credits": 0,
      "refundable_credits": 0,
      "excess_payments": 0,
      "unbilled_charges": 0,
      "preferred_currency_code": "EUR",
      "mrr": 0,
      "primary_payment_source_id": "pm_BTUUpAURUxJnw6ee9",
      "payment_method": {
        "object": "payment_method",
        "type": "direct_debit",
        "reference_id": "cus_R4444iKHJzgA/src_1WQE3SLBcvDPw5OQnJXzCmYM",
        "gateway": "stripe",
        "gateway_account_id": "gw_df222gdsba2",
        "status": "valid"
      }
    },
    "invoice": {
      "id": "542",
      "customer_id": "BTUUpAURUxIut6edX",
      "subscription_id": "199PaHURUwwBN6cV0",
      "recurring": true,
      "status": "paid",
      "price_type": "tax_exclusive",
      "date": 1729200078,
      "due_date": 1729200078,
      "net_term_days": 0,
      "exchange_rate": 1.0,
      "total": 1000,
      "amount_paid": 1000,
      "amount_adjusted": 0,
      "write_off_amount": 0,
      "credits_applied": 0,
      "amount_due": 0,
      "paid_at": 1729200079,
      "updated_at": 1729200081,
      "resource_version": 1729200081251,
      "deleted": false,
      "object": "invoice",
      "first_invoice": true,
      "amount_to_collect": 0,
      "round_off_amount": 0,
      "new_sales_amount": 1000,
      "has_advance_charges": false,
      "currency_code": "EUR",
      "base_currency_code": "EUR",
      "generated_at": 1729200078,
      "is_gifted": false,
      "term_finalized": true,
      "channel": "web",
      "tax": 0,
      "line_items": [{
        "id": "li_BTUUpAURUxIz16ede",
        "date_from": 1729200078,
        "date_to": 1731882078,
        "unit_amount": 1000,
        "quantity": 1,
        "amount": 1000,
        "pricing_model": "flat_fee",
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "199PaHURUwwBN6cV0",
        "customer_id": "BTUUpAURUxIut6edX",
        "description": "1-boom-per-maand",
        "entity_type": "plan_item_price",
        "entity_id": "1-boom-per-maand-EUR-Monthly",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }],
      "sub_total": 1000,
      "linked_payments": [{
        "txn_id": "txn_BTUUpAUAADIzm6edf",
        "applied_amount": 1000,
        "applied_at": 1729200081,
        "txn_status": "success",
        "txn_date": 1729200079,
        "txn_amount": 1000
      }],
      "applied_credits": [],
      "adjustment_credit_notes": [],
      "issued_credit_notes": [],
      "linked_orders": [],
      "dunning_attempts": [],
      "billing_address": {
        "first_name": "Manes",
        "last_name": "Norws",
        "line1": "Atraat 4",
        "city": "Aborg",
        "state": "Grnd",
        "country": "NL",
        "zip": "1234 GG",
        "validation_status": "not_validated",
        "object": "billing_address"
      },
      "shipping_address": {
        "first_name": "Manes",
        "last_name": "Norws",
        "line1": "Atraat 4",
        "city": "Aborg",
        "state": "Grnd",
        "country": "NL",
        "zip": "1234 GG",
        "validation_status": "not_validated",
        "object": "shipping_address"
      },
      "site_details_at_creation": {
        "timezone": "Europe/Amsterdam",
        "organization_address": {
          "organization_name": "Plant N Boom",
          "email": "test@example.com",
          "line1": "Iweg 2-1",
          "city": "Men",
          "state": "Utrecht",
          "country_code": "NL",
          "zip": "2222ES",
          "phone": "+312200392",
          "website": "https://www.planteenboom.nu"
        }
      },
      "tax_origin": {"country": "NL"}
    }
  },
  "event_type": "subscription_created",
  "webhook_status": "not_configured",
  "webhooks": [{
    "id": "whv2_20sdfgfdM4kl4V",
    "webhook_status": "succeeded",
    "object": "webhook"
  }]
}